{
    "language": "Malay",
    "homepage": {
        "name": "Edward Wee",
        "role": "Jurutera Perisian",
        "greeting": "Salam Sejahtera",
        "about_me": "Tentang Saya",
        "description": "Saya seorang jurutera perisian yang beraspirasi dan mempunyai pengalaman membina aplikasi web dan mobile. Saya kini berada di tahun akhir pengajian saya, Sarjana Muda dalam Sains Komputer pengkhususan dalam sistem komputer dan rangkaian di Universiti Malaya dan sedang mencari peluang kerjaya.",
        "resume": "Resume",
        "projects": "Projek"
    },
    "experience_page": {
        "title_1": "PENGA",
        "title_2": "LAMAN",
        "subtitle": "PROFESIONAL AND AKADEMIK",
        "education": "Pendidikan",
        "professional": "Profesional",
        "education_1": {
            "date": "2012-2016",
            "experience": "Sijil Pelajaran Malaysia (SPM)",
            "description": "Telah mencapai 9A's ( 2A+ , 6A , 1A-) dalam SPM aliran sains tulen."
        },
        "education_2": {
            "date": "2017-2018",
            "experience": "Sijil Tinggi Persekolahan Malaysia (STPM)",
            "description": "Telah mencapai CGPA 3.83 ( 3A , 1B+ ) dalam STPM aliran sains tulen."
        },
        "education_3": {
            "date": "Dari September 2019",
            "experience": "Ijazah Sarjana Muda Sains Komputer di UM",
            "description": "Khusus dalam Sistem dan Rangkaian Komputer di University Malaya dengan pencapaian CGPA 3.96"
        },
        "professional_1": {
            "date": "Mac 2021 - Mac 2022",
            "experience": "Digital Resilience SBX (DRSBX)",
            "description": "Pasukan kami terdiri daripada 6 orang telah mengambil tugas daripada Universiti New South Wales untuk membangunkan aplikasi web penilaian keselamatan. Saya bertanggungjawab sebagai seorang backend developer dalam projek ini."
        },
        "professional_2": {
            "date": "Julai 2021 - Januari 2022",
            "experience": "Cognixus Technologies - Jurutera Perisian Pelatih",
            "description": "Menjalankan latihan industri sebagai jurutera perisian. Mempelajari cara mereka bentuk dan membangunkan aplikasi mudah alih dan web yang boleh skala. Mempelajari cara membangunkan bahagian belakang aplikasi dan Docker."
        },
        "professional_3": {
            "date": "Mac 2022 - Kini",
            "experience": "Sistem Penilaian Prestasi Pekerja (FYP)",
            "description": "Bekerjasama dengan Cognixus Technologies untuk membangunkan pemalam semakan prestasi untuk sistem HRMS Hexfere sedia ada."
        }
    },
    "contact_page": {
        "title_1": "HUBUNGI ",
        "title_2": "SAYA",
        "subtitle": "HENDAK BERHUBUNG? INI BAGAIMANA BELIAU BOLEH MENGHUBUNGI SAYA.",
        "contact_1_description": "Hantarkan e-mel kepada saya !",
        "contact_2_description": "Mesej saya di Whatsapp !",
        "contact_3_description": "Mari sambung di LinkedIn !",
        "contact_4_description": "Lihat repo Github saya !",
        "contact_5_description": "Lihat akaun Leetcode saya !",
        "contact_6_description": "Lihat akaun Kaggle saya !"
    },
    "skills_page": {
        "title_1": "KEMAH",
        "title_2": "IRAN",
        "subtitle": "INI ADALAH KEMAHIRAN SAYA",
        "skill_1": "CSS",
        "skill_2": "DJANGO",
        "skill_3": "DOCKER",
        "skill_4": "FLASK",
        "skill_5": "FLUTTER",
        "skill_6": "GIT",
        "skill_7": "HEROKU",
        "skill_8": "HTML",
        "skill_9": "I18N",
        "skill_10": "NETLIFY",
        "skill_11": "NUXT",
        "skill_12": "POSTGRES",
        "skill_13": "POSTMAN",
        "skill_14": "PYTHON",
        "skill_15": "VUE"
    },
    "projects_page": {
        "title_1": "PROJEK ",
        "title_2": "TERLIBAT",
        "subtitle": "INI DALAM PERJALANAN SAYA",
        "link": "Pautan",
        "click_here": "Klik Sini",
        "category": "Kategori",
        "status": "Status",
        "project_1": {
            "title": "BeFitter",
            "start_date": "Disember 2020",
            "end_date": "Januari 2021",
            "category": "Projek Kendiri",
            "status": "Selesai",
            "description": "Blog latihan ringkas yang dibina menggunakan Django. Sepanjang projek ini, saya telah didedahkan kepada asas pembangunan web terutamanya dalam HTML dan CSS. Selain itu, saya juga telah mempelajari cara mengerahkan aplikasi Django pada Heroku dengan projek ini."
        },
        "project_2": {
            "title": "Penjejak Anime",
            "start_date": "April 2021",
            "end_date": "Mei 2021",
            "category": "Project Kendiri",
            "status": "Selesai",
            "description": "Penjejak Anime mengambil data daripada API Jikan dan membenarkan pengguna melakukan operasi CRUD. Projek ini telah mendedahkan saya kepada penggunaan REST API untuk memautkan React Frontend dan Django Backend saya bersama-sama."
        },
        "project_3": {
            "title": "Projek Kelas Algoritma (Jarak Terpendek Antara 2 Lokasi)",
            "start_date": "Mac 2021",
            "end_date": "Jun 2021",
            "category": "Tugasan Universiti",
            "status": "Selesai",
            "description": "Kami telah ditugaskan untuk mencipta aplikasi yang mengira jarak pemanduan terpendek antara dua lokasi input oleh pengguna. Kami telah menggunakan API Map Box dan menggunakan algoritma \"min-heap\" untuk mengira dan memutuskan jarak terpendek yang disediakan oleh API Map Box."
        },
        "project_4": {
            "title": "Applikasi Mobile Pay It Forward",
            "start_date": "Julai 2021",
            "end_date": "Oktober 2021",
            "category": "Latihan Amali",
            "status": "Selesai",
            "description": "Pay It Forward (PIF) ialah platform untuk mempromosikan komuniti penyayang melalui semangat berkongsi dan membayar ke hadapan. Sepanjang pembangunan projek ini, saya telah mempelajari cara melaksanakan reka bentuk UI/UX, logik perniagaan, pengurusan keadaan dan ujian unit menggunakan rangka kerja Flutter. Tambahan pula, saya juga telah memperoleh pengalaman berharga dalam pembangunan aplikasi mudah alih peringkat industri."
        },
        "project_5": {
            "title": "Laman Web Pay It Forward",
            "start_date": "Oktober 2021",
            "end_date": "November 2021",
            "category": "Latihan Amali",
            "status": "Selesai",
            "description": "Saya dan rakan pelatih dari UM telah ditugaskan untuk membangunkan laman web untuk Pay It Forward (PIF). Saya telah mempelajari cara membangunkan tapak web responsif menggunakan Nuxt Js yang mempunyai fungsi penukaran bahasa menggunakan perkhidmatan i18n dan pengesahan e-mel menggunakan vee-validate. Saya juga telah belajar cara menulis arahan Docker dan mengerahkan imej Docker ke Kubernetes Cluster."
        },
        "project_6": {
            "title": "Aplikasi Sesawang Hexfere HRMS Jetson Nano",
            "start_date": "Disember 2021",
            "end_date": "Januari 2022",
            "category": "Latihan Amali",
            "status": "Selesai",
            "description": "Mencipta aplikasi web untuk menggunakan Flask yang membolehkan pasukan ML menyepadukan teknologi pengecaman muka ke dalamnya. Rangka kerja mikro Flask mengurangkan penggunaan sumber dan membolehkan Jetson Nano memperuntukkan lebih banyak sumber untuk teknologi pengecaman muka."
        },
        "project_7": {
            "title": "Digital Resilience SBX",
            "start_date": "Mac 2021",
            "end_date": "Mac 2022",
            "category": "Kerja Sambilan",
            "status": "Selesai",
            "description": "Kami, sebuah kumpulan yang terdiri daripada 6 ahli dari Universiti Malaya telah ditugaskan oleh Dr Yenni Tim dari The University of New South Wales untuk mencipta prototaip aplikasi Web Penilaian Keselamatan Siber. Saya bertanggungjawab untuk pembangunan bahagian belakang projek bersama-sama dengan ketua kumpulan saya. Sepanjang projek ini, saya telah mempelajari cara mereka bentuk pangkalan data, melaksanakan reka bentuk dalam Django dengan menulis model dan mencipta API untuk operasi CRUD. Saya juga telah mempelajari cara menjalankan ujian unit dan menyesuaikan Halaman Pentadbiran Django. Tambahan pula, saya juga telah mempelajari cara untuk menyediakan Docker dan Docker Compose untuk membolehkan kami mengerahkan sebagai titisan di Lautan Digital."
        },
        "project_8": {
            "title": "Penjejak Perbelanjaan",
            "start_date": "Januari 2022",
            "end_date": "Kini",
            "category": "Projek Kendiri",
            "status": "Berterusan",
            "description": "Memulakan projek Penjejak Perbelanjaan untuk meningkatkan lagi kemahiran pembangunan mudah alih saya. Saya telah mempelajari lebih mendalam tentang Pengurusan State Flutter (Cubit dan State). Tambahan pula, saya juga telah mempelajari cara melaksanakan operasi CRUD melalui penggunaan Firestore Firebase sebagai pangkalan data No SQL."
        },
        "project_9": {
            "title": "Laman Web Portfolio V2",
            "start_date": "Mac 2022",
            "end_date": "April 2022",
            "category": "Projek Kendiri",
            "status": "Selesai",
            "description": "Memutuskan untuk menggunakan kemahiran yang telah saya pelajari semasa latihan saya untuk membina semula halaman web portfolio saya menggunakan Nuxt Js dan dihoskan di Netlify. Ini adalah laman web portfolio lama saya, https://edwardweeold.netlify.app/ sebelum menjalani latihan amali. Telah menggunakan reka bentuk responsif mudah alih pada laman web portfolio semasa."
        }
    },
    "experience": "Pengalaman",
    "skills": "Kemahiran",
    "projects": "Projek",
    "chinese": "简体中文",
    "contact": "Hubung",
    "english": "English",
    "footer": {
        "credit": "Hak Cipta Terpelihara © 2022 Edward Wee."
    },
    "home": "Laman utama",
    "malay": "Malay"
}